bit-finance/Reports/бит_УниверсальныйОтчетПоИсточникамДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>бит_УниверсальныйОтчетПоИсточникамДанных</Name>
		</Properties>
	</Report>
</MetaDataObject>

bit-finance/Enums/бит_ВидыПараметровЗапроса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыПараметровЗапроса</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Значение</Name>
					<Comment>Значение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Список</Name>
					<Comment>Список</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выражение</Name>
					<Comment>Выражение</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/Reports/бит_УниверсальныйОтчетПоИсточникамДанных/Forms/НастройкиИсточника/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Параметры.НастройкаОтчета) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,,
							НСтр("ru = 'Настройка отчета'; en = 'Report Setup'"));
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	НастройкаОтчета = Параметры.НастройкаОтчета;
	Заголовок		= Параметры.Заголовок;
	
	ЗагрузитьНастройкиКомпоновкиВДанныеФормы(Параметры);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПараметрыИсточника

&НаКлиенте
Процедура ПараметрыИсточникаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	ТекущиеДанные = Элементы.ПараметрыИсточника.ТекущиеДанные;	 	
	
	Если НоваяСтрока И НЕ Копирование Тогда  		
		ТекущиеДанные.ВидПараметра = ПредопределенноеЗначение("Перечисление.бит_ВидыПараметровЗапроса.Значение");   			
	КонецЕсли; 
	
	ТекущийВидПараметра = ТекущиеДанные.ВидПараметра;
	
	ОграничитьОписаниеТиповПараметра();
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыИсточникаВидПараметраПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПараметрыИсточника.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		Идентификатор = Элементы.ПараметрыИсточника.ТекущиеДанные.ПолучитьИдентификатор();
		ИзменитьВидПараметра(Идентификатор, ТекущийВидПараметра);
		
		ТекущийВидПараметра = ТекущиеДанные.ВидПараметра;
		
		ОграничитьОписаниеТиповПараметра();
				
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ПараметрыИсточникаЗначениеПараметраНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные       = Элементы.ПараметрыИсточника.ТекущиеДанные;	
	ТекущийВидПараметра = ТекущиеДанные.ВидПараметра;
	
	Если ТекущийВидПараметра = ПредопределенноеЗначение("Перечисление.бит_ВидыПараметровЗапроса.Выражение") Тогда  		
		СтандартнаяОбработка = Ложь;			
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПараметрыИсточникаЗначениеПараметраОчистка(Элемент, СтандартнаяОбработка)

	ТекущиеДанные = Элементы.ПараметрыИсточника.ТекущиеДанные;
	
	Если ТекущиеДанные.ВидПараметра = ПредопределенноеЗначение("Перечисление.бит_ВидыПараметровЗапроса.Значение") Тогда		
		Элементы.ПараметрыИсточникаЗначениеПараметра.ВыбиратьТип = Истина;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтборыИсточника
	
&НаКлиенте
Процедура ОтборыИсточникаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.ОтборыИсточника.ТекущиеДанные;	
	
	Элементы.ОтборыИсточникаЗначение.ВыбиратьТип = (ТекущиеДанные.Значение = Неопределено);
	
	Если НЕ НоваяСтрока Тогда
		бит_МеханизмПолученияДанныхКлиентСервер.УстановитьСвойствоВыборГруппИЭлементов(Элементы.ОтборыИсточникаЗначение, 
			ТекущиеДанные.ВидСравнения);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОтборыИсточникаВидСравненияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ОтборыИсточника.ТекущиеДанные;
	ИзменениеВидаСравненияОтборовИсточника(ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборыИсточникаЗначениеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОтборыИсточника.ТекущиеДанные;
	ИзменениеЗначенияОтборовИсточника(ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборыИсточникаЗначениеОчистка(Элемент, СтандартнаяОбработка)
	
	Элементы.ОтборВОтчетеЗначение.ВыбиратьТип = Истина;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыОтборыИсточника

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	
	ОповеститьОВыборе(РезультатВыбора());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьНастройкиКомпоновкиВДанныеФормы(ДоступныеНастройки)
		
	Если ДоступныеНастройки.ПользовательскиеНастройки = Неопределено Тогда
		НовыеПользовательскиеНастройки = Отчет.ПользовательскиеНастройки.ПользовательскиеНастройки;
	Иначе	
		НовыеПользовательскиеНастройки = ДоступныеНастройки.ПользовательскиеНастройки;
	КонецЕсли;

	ПараметрКомпоновщика = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(НовыеПользовательскиеНастройки, "НастройкиИсточника");
	Если ПараметрКомпоновщика = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗначениеПараметра = ПараметрКомпоновщика.Значение;
	Если ТипЗнч(ЗначениеПараметра) = Тип("ХранилищеЗначения") Тогда
		НастройкиИсточника = ЗначениеПараметра.Получить();
		Если ТипЗнч(НастройкиИсточника) = Тип("Структура") Тогда
			Если НастройкиИсточника.Свойство("ПараметрыИсточника") Тогда
				Если ТипЗнч(НастройкиИсточника.ПараметрыИсточника) = Тип("ТаблицаЗначений") Тогда
					ПараметрыИсточника.Очистить();
					ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(НастройкиИсточника.ПараметрыИсточника, ПараметрыИсточника);
				КонецЕсли;
			КонецЕсли;
			Если НастройкиИсточника.Свойство("ОтборыИсточника") Тогда
				Если ТипЗнч(НастройкиИсточника.ОтборыИсточника) = Тип("ТаблицаЗначений") Тогда
					ОтборыИсточника.Очистить();
					ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(НастройкиИсточника.ОтборыИсточника, ОтборыИсточника);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОграничитьОписаниеТиповПараметра()

	ТекущиеДанные = Элементы.ПараметрыИсточника.ТекущиеДанные;
	
	Если ТекущийВидПараметра = ПредопределенноеЗначение("Перечисление.бит_ВидыПараметровЗапроса.Выражение") Тогда
		ОписаниеОграничение = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(500));
	Иначе
		
		Если ТекущиеДанные.ЗначениеПараметра = Неопределено Тогда  		
			Элементы.ПараметрыИсточникаЗначениеПараметра.ВыбиратьТип = Истина; 		
		Иначе	                                                        		
			Элементы.ПараметрыИсточникаЗначениеПараметра.ВыбиратьТип = Ложь;  		
		КонецЕсли; 
		
		ДобавляемыеТипы = Новый Массив;
		ДобавляемыеТипы.Добавить(Тип("СписокЗначений"));
		Если ЗначениеЗаполнено(ТекущиеДанные.ДоступныеТипы) Тогда
			ОписаниеОграничение = Новый ОписаниеТипов(ТекущиеДанные.ДоступныеТипы, ДобавляемыеТипы);
		Иначе		
			ОписаниеОграничение = Новый ОписаниеТипов;
		КонецЕсли;
	КонецЕсли;	
	
	Элементы.ПараметрыИсточникаЗначениеПараметра.ОграничениеТипа = ОписаниеОграничение;  

КонецПроцедуры

&НаСервере
Процедура ИзменитьВидПараметра(Идентификатор, ТекущийВидПараметра)

	ТекущиеДанные = ПараметрыИсточника.НайтиПоИдентификатору(Идентификатор);
	бит_МеханизмПолученияДанных.ИзменениеВидаПараметра(ТекущиеДанные, ТекущийВидПараметра);

КонецПроцедуры

&НаСервере
Процедура ИзменениеВидаСравненияОтборовИсточника(Идентификатор)
		
	ТекущиеДанные = ОтборыИсточника.НайтиПоИдентификатору(Идентификатор);
	бит_МеханизмПолученияДанных.ИзменениеВидаСравнения(ТекущиеДанные);	
	
	бит_МеханизмПолученияДанныхКлиентСервер.УстановитьСвойствоВыборГруппИЭлементов(Элементы.ОтборыИсточникаЗначение, 
			ТекущиеДанные.ВидСравнения);

КонецПроцедуры

&НаСервере
Процедура ИзменениеЗначенияОтборовИсточника(Идентификатор)
	
	ТекущиеДанные = ОтборыИсточника.НайтиПоИдентификатору(Идентификатор);
	бит_МеханизмПолученияДанных.ОтборВОтчетеЗначениеПриИзменении(ТекущиеДанные);
		
КонецПроцедуры

&НаКлиенте
Функция РезультатВыбора()

	Переформировать = Модифицированность;
	
	Если НЕ Модифицированность Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	РезультатВыбора = Новый Структура;
	РезультатВыбора.Вставить("ИмяСобытия", ВариантыОтчетовСлужебныйКлиентСервер.ИмяСобытияФормыНастроек());
	РезультатВыбора.Вставить("Переформировать", Переформировать);
	РезультатВыбора.Вставить("ПользовательскиеНастройкиМодифицированы", Истина);
	РезультатВыбора.Вставить("НастройкиИсточника", Неопределено);
	
	ЗаполнитьРезультаВыбораНаСервере(РезультатВыбора);

	Возврат РезультатВыбора;

КонецФункции

&НаСервере
Процедура ЗаполнитьРезультаВыбораНаСервере(РезультатВыбора)

	НастройкиИсточника = Новый Структура("ПараметрыИсточника, ОтборыИсточника");
	НастройкиИсточника.ПараметрыИсточника = РеквизитФормыВЗначение("ПараметрыИсточника");
	НастройкиИсточника.ОтборыИсточника	  = РеквизитФормыВЗначение("ОтборыИсточника");
	
	РезультатВыбора.НастройкиИсточника = Новый ХранилищеЗначения(НастройкиИсточника, Новый СжатиеДанных(9));

КонецПроцедуры

#КонецОбласти
